Repository: Noospheratu/FlawFinder.new
Catalog: i18n/*/LC_MESSAGES/flawfinder.po
Languages: ru_ru

source: flawfinder [--help | -h] [--version] [--listrules] [--allowlink] [--followdotdir] [--nolink] [--patch filename | -P filename] [--inputs | -I] [--minlevel X | -m X] [--falsepositive | -F] [--neverignore | -n] [--context | -c] [--columns | -C] [--dataonly | -D] [--html | -H] [--immediate | -i] [--singleline | -S] [--omittime] [--quiet | -Q] [--loadhitlist F] [--savehitlist F] [--diffhitlist F] [--] [source code file or source root directory]+ The options cover various aspects of flawfinder as follows. Documentation: --help | -h Show this usage help. --version Show version number. --listrules List the rules in the ruleset (rule database). Selecting Input Data: --allowlink Allow symbolic links. --followdotdir Follow directories whose names begin with ".". Normally they are ignored. --nolink Skip symbolic links (ignored). --patch F | -P F Display information related to the patch F (patch must be already applied). Selecting Hits to Display: --inputs | -I Show only functions that obtain data from outside the program; this also sets minlevel to 0. -m X | --minlevel=X Set minimum risk level to X for inclusion in hitlist. This can be from 0 (``no risk'') to 5 (``maximum risk''); the default is 1. --falsepositive | -F Do not include hits that are likely to be false positives. Currently, this means that function names are ignored if they're not followed by "(", and that declarations of char- acter arrays aren't noted. Thus, if you have use a vari- able named "access" everywhere, this will eliminate refer- ences to this ordinary variable. This isn't the default, because this also increases the likelihood of missing important hits; in particular, function names in #define clauses and calls through function pointers will be missed. --neverignore | -n Never ignore security issues, even if they have an ``ignore'' directive in a comment. --regex PATTERN | -e PATTERN Only report hits that match the regular expression PATTERN. Selecting Output Format: --columns | -C Show the column number (as well as the file name and line number) of each hit; this is shown after the line number by adding a colon and the column number in the line (the first character in a line is column number 1). --context | -c Show context (the line having the "hit"/potential flaw) --dataonly | -D Don't display the headers and footers of the analysis; use this along with --quiet to get just the results. --html | -H Display as HTML output. --immediate | -i Immediately display hits (don't just wait until the end). --singleline | -S Single-line output. --omittime Omit time to run. --lang=en|ru Change output localization. Default: System setting --quiet | -Q Don't display status information (i.e., which files are being examined) while the analysis is going on. Hitlist Management: --savehitlist=F Save all hits (the "hitlist") to F. --loadhitlist=F Load hits from F instead of analyzing source programs. --diffhitlist=F Show only hits (loaded or analyzed) not in F. For more information, please consult the manpage or available documentation.
ru_ru: flawfinder [--help | -h] [--version] [--listrules] [--allowlink] [--followdotdir] [--nolink] [--patch имя_файла | -P filename] [--inputs | -I] [--minlevel X | -m X] [--falsepositive | -F] [--neverignore | -n] [--context | -c] [--columns | -C] [--dataonly | -D] [--html | -H] [--immediate | -i] [--singleline | -S] [--omittime] [--quiet | -Q] [--loadhitlist F] [--savehitlist F] [--diffhitlist F] [--] [исходный код файла или путь корневой папки]+ Опции охватывают различные аспекты FlawFinder Документация: --help | -h Показать эту информацию. --version Показать номер версии. --listrules Показать правила из набора (База данных правил). Выбор входных данных: --allowlink Разрешить символьные ссылки. --followdotdir Просматривать папки, имена которых начинаются с ".". По-умолчанию такие папки игнорируются. --nolink Пропустить символьные ссылки (игнорируются). --patch F | -P F Показать информацию, связанную с патчем F (патч должен быть уже применен). Выбор хитов для отображения: --inputs | -I Показать только функции, которые получают данные извне программы; это также устанавливает минимальный уровень на 0. -m X | --minlevel=X Установить минимальный уровень риска X для включения в список результатов. Может быть от 0 (``без риска'') до 5 (``максимальный риск''); По-умолчанию: 1. --falsepositive | -F Не включать хиты, которые могут быть и ложные срабатывания. Currently, this means that function names are ignored if they're not followed by "(", and that declarations of char- acter arrays aren't noted. Thus, if you have use a vari- able named "access" everywhere, this will eliminate refer- ences to this ordinary variable. This isn't the default, because this also increases the likelihood of missing important hits; in particular, function names in #define clauses and calls through function pointers will be missed. --neverignore | -n Никогда не игнорировать вопросы безопасности, даже если они имеют директиву ``ignore'' в комментарии --regex PATTERN | -e PATTERN Только сообщить хитов, которые соответствуют регулярному выражению PATTERN. Параметры вывода: --columns | -C Показать номер столбца (а также имя файла и номер строки) каждого хита; это показано после номера строки, добавив двоеточие и номер столбца в строке (первый символ в строке является номер столбца 1). --context | -c Показать контекст (линию, имеющую потенциальный недостаток) --dataonly | -D Не показывать верхние и нижние колонтитулы анализа; Используйте это вместе с --quiet чтобы получить только результаты. --html | -H Вывод в HTML. --immediate | -i Вывод результутов сразу (не ждать пока процесс полностью завершится). --singleline | -S Вывод по одной строке --omittime Не показывать время выполнения --lang=en|ru Сменить язык вывода. По-умолчанию: системная установка --quiet | -Q Не отображать информацию о состоянии Управление списком результатов: --savehitlist=F Сохранить все результаты в файл F. --loadhitlist=F Загрузить результаты из файла F вместо анализа исходных кодов --diffhitlist=F Показать результаты не входящие в F. Для получения более подробной информации, пожалуйста, обратитесь к странице справочника или к имеющейся документации.

source: Loading hits from
ru_ru: Загрузка срабатываний из

source: Saving hitlist to
ru_ru: Сохранение списка срабатываний в

source: Showing hits not in
ru_ru: Показ срабатываний, не входящих в

source: *** getopt error:
ru_ru: *** ошибка входных параметров

source: Error: {message}
ru_ru: Ошибка: {message}

source: Warning:
ru_ru: Предупреждение:

source: Error: failed to open
ru_ru: ﻿Ошибка: не удалось открыть

source: Error: Unrecognized patch format
ru_ru: ﻿Ошибка: Неизвестный формат патча

source: filename occurs more than once in the patch: {patched_filename}
ru_ru: ﻿Имя файла встречается более одного раза в патче: {patched_filename}

source: wrong type of patch file: we have a line number without having seen a filename
ru_ru: ﻿неправильный тип файла патча: есть номер строки, но отсутствует имя файла

source: Parsing failed to find end of parameter list; semicolon terminated it in {text}
ru_ru: ﻿анализ, не удалось найти конец списка параметров; точка с запятой завершает его в {text}

source: Parsing failed to find end of parameter list in {text}
ru_ru: Парсинг не удался, не удалось найти конец списка параметров в {text}

source: Risk is low because the source is a constant character.
ru_ru: Уровень риска низкий, поскольку источник это символьная константа.

source: Risk is low because the source is a constant string.
ru_ru: Уровень риска низкий, поскольку источник это строковая константа.

source: Risk is high; the length parameter appears to be a constant,
ru_ru: Высокий уровень риска; появляется параметр длины, чтобы быть константой,

source: instead of computing the number of characters left.
ru_ru: ﻿вместо вычисления количества оставшихся символов.

source: On some very old systems, snprintf is incorrectly implemented
ru_ru: ﻿На некоторых очень старых систем, snprintf неправильно реализована

source: and permits buffer overflows; there are also incompatible
ru_ru: и допускает переполнение буфера; Есть также несовместимые

source: standard definitions of it
ru_ru: стандарты определения функции

source: Check it during installation, or use something else
ru_ru: ﻿Проверьте это во время установки, или использовать что-то другое

source: port
ru_ru: ﻿порт

source: format string parameter problem
ru_ru: проблема форматирования параметра строки

source: Check if required parameters present and quotes close.
ru_ru: ﻿Проверьте, если требуемые параметры присутствуют и кавычки закрыты.

source: format
ru_ru: форматирование

source: Risk is low because the source has a constant maximum length.
ru_ru: Уровень риска низкий, поскольку источник имеет постоянную максимальную длину.

source: Potential format string problem (CWE-134)
ru_ru: Потенциальная проблема форматирования строки (CWE-134)

source: Risk is high, it appears that the size is given as bytes, but the
ru_ru: Высокий уровень риска, это означает, что размер задан в виде байтов, но

source: function requires size as characters.
ru_ru: функция требует размер в символах.

source: Risk is very low, the length appears to be in characters not bytes.
ru_ru: Уровень риска низкий, длина означает размер в символах, а не в байтах.

source: Does not check for buffer overflows when copying to destination (CWE-120)
ru_ru: Нет проверки на переполнение буфера при копировании в аргумент-назначение (CWE-120).

source: Does not check for buffer overflows when concatenating to destination (CWE-120)
ru_ru: Нет проверки на переполнение буфера при объединении с аргументом-назначением (CWE-120).

source: Easily used incorrectly; doesn't always \0-terminate or check for invalid pointers (CWE-120)
ru_ru: Функция легко может быть использована некорректно, не всегда завершает строки символом '0' , не проверяет некорректные указатели (CWE-120).

source: Easily used incorrectly (e.g., incorrectly computing the correct maximum size to add) (CWE-120)
ru_ru: Функция легко может быть использована некорректно (например, некорректно вычисляется корректный максимальный размер для добавления) (CWE-120).

source: Subject to buffer overflow if buffer is not as big as claimed (CWE-120)
ru_ru: Использование функции приводит к переполнению буфера, если буфер не такой большой, как заявлено (СWE-120).

source: Statically-sized arrays can be improperly restricted, leading to potential overflows or other issues (CWE-119, CWE-120)
ru_ru: Статически определённые массивы могут быть неправильно ограничены, что ведёт к потенциальному переполнению или другим проблемам (CWE-119, CWE-120).

source: Does not check for buffer overflows (CWE-120, CWE-20)
ru_ru: Нет проверки на переполнение буфера (CWE-120, CWE-20)

source: Use fgets() instead
ru_ru: Взамен используйте fgets()

source: Does not check for buffer overflows (CWE-120)
ru_ru: Нет проверки на переполнение буфера (CWE-120)

source: Use sprintf_s, snprintf, or vsnprintf
ru_ru: Используйте sprintf_s, snprintf или vsnprintf

source: If format strings can be influenced by an attacker, they can be exploited (CWE-134)
ru_ru: Если атакующий может влиять на содержание форматной строки, уязвимость может быть эксплуатирована (CWE-134)

source: If syslog's format strings can be influenced by an attacker, they can be exploited (CWE-134)
ru_ru: Если атакующий может влиять на содержание форматной строки syslog, уязвимость может быть эксплуатирована. (CWE-134)

source: If format strings can be influenced by an attacker, they can be exploited, and note that sprintf variations do not always \0-terminate (CWE-134)
ru_ru: Если атакующий может влиять на содержание форматной строки, уязвимость может быть эксплуатирована. Следует помнить, что варианты функции sprintf не всегда работают с завершающим нулём. (CWE-134)

source: The scanf() family's %s operation, without a limit specification, permits buffer overflows (CWE-120, CWE-20)
ru_ru: Использование %s функций семейства scanf() без определения ограничений создаёт предпосылки к переполнениям буфера (CWE-120, CWE-20)

source: Does not handle strings that are not \0-terminated; if given one it may perform an over-read (it could cause a crash if unprotected) (CWE-126)
ru_ru: Не обрабатывает строки, которые не завершаются символом '0', в таком случае может выполнить чтение за пределами строки (что может привести к аварийному завершению программы, если отсутствует защита от подобных сбоев) (CWE-126).

source: Requires maximum length in CHARACTERS, not bytes (CWE-120)
ru_ru: Требует указания максимальной длины в CHARACTERS, не в байтах (CWE-120).

source: This function does not protect against buffer overflows (CWE-120)
ru_ru: Эта функция не защищена от переполнений буфера (CWE-120).

source: This function does not protect against buffer overflows, and some implementations can overflow internally (CWE-120/CWE-785)
ru_ru: Данная функция не защищает против переполнений буфера. Также некоторые реализации содержат внутренние уязвимости переполнения (CWE-120/CWE-785).

source: Some older implementations do not protect against internal buffer overflows (CWE-120, CWE-20)
ru_ru: Некоторые старые реализации не защищены от внутреннего переполнения буфера (CWE-120, CWE-20).

source: Some implementations may overflow buffers (CWE-120, CWE-20)
ru_ru: ﻿Некоторые реализации могут переполнять буфер (CWE-120, CWE-20)

source: This does not protect against buffer overflows by itself, so use with caution (CWE-120, CWE-20)
ru_ru: Данная функция не содержит защиты от переполнения буфера, необходимо использовать с осторожностью (CWE-120, CWE-20).

source: Check buffer boundaries if used in a loop including recursive loops (CWE-120, CWE-20)
ru_ru: Необходимо проверять границы буфера, если он используется в цикле, включая рекурсивные циклы (CWE-120, CWE-20).

source: This usually indicates a security flaw. If an attacker can change anything along the path between the call to access() and the file's actual use (e.g., by moving files), the attacker can exploit the race condition (CWE-362/CWE-367)
ru_ru: Данная функция обычно указывает на уязвимость безопасности. Если атакующий может изменить что-либо на пути между вызовом access() и действительным использованием файлов, (например, переместить файл), атакующий может эксплуатировать 'гонку условий' (CWE-362/CWE-367).

source: This accepts filename arguments; if an attacker can move those files, a race condition results. (CWE-362)
ru_ru: Принимает имена файлов в качестве аргументов, если атакующий может переместить эти файлы, возникнет 'гонка условий' (CWE-362).

source: On some old systems, vfork() permits race conditions, and it's very difficult to use correctly (CWE-362)
ru_ru: На некоторых старых системах функция vfork() подвержена гонке условий, в связи с чем её очень трудно использовать корректно (CWE-362).

source: This accepts filename arguments; if an attacker can move those files or change the link content, a race condition results. Also, it does not terminate with ASCII NUL. (CWE-362, CWE-20)
ru_ru: Принимает имена файлов в качестве аргументов, если атакующий может переместить эти файлы или изменить содержимое ссылки, возникнет 'гонка условий'. Также, не заканчивает строки символом ASCII NUL (CWE-362, CWE-20).

source: Function tmpfile() has a security flaw on some systems (e.g., older System V systems) (CWE-377)
ru_ru: Функция tmpfile() имеет уязвимости безопасности на некоторых системах (например, на старых системах System V) (CWE-377).

source: Temporary file race condition (CWE-377)
ru_ru: Гонка условий на временных файлах (CWE-377).

source: Potential for temporary file vulnerability in some circumstances. Some older Unix-like systems create temp files with permission to write by all by default, so be sure to set the umask to override this. Also, some older Unix systems might fail to use O_EXCL when opening the file, so make sure that O_EXCL is used by the library (CWE-377)
ru_ru: В некоторых случаях при использовании временных файлов функция может быть уязвима. Некоторые старые Unix-подобные системы создают временные файлы с разрешениями на запись по умолчанию, поэтому необходимо проконтролировать наличие вызова umask для перезаписи этих разрешений. Также, на некоторых старых Unix-подобных системах могут проявляться сбои при использовании флага O_EXCL во время открытия файла, поэтому необходимо проверить случаи использования O_EXCL библиотекой (CWE-377).

source: Check when opening files - can an attacker redirect it (via symlinks), force the opening of special file type (e.g., device files), move things around to create a race condition, control its ancestors, or change its contents? (CWE-362)
ru_ru: При открытии файлов их необходимо проверять: атакующий может перенаправить их (с использованием механизма символьных ссылок), чтобы заставить программу открыть файлы специальных типов (например, файлы устройств), может переместить файлы, чтобы создать гонку условий, управлять его владельцем или изменить его содержание (CWE-362).

source: Ensure that umask is given most restrictive possible setting (e.g., 066 or 077) (CWE-732)
ru_ru: Для безопасного использования необходимо убедиться, что функции umask() передаётся наибольшие возможные ограничивающие настройки (например, 066 или 077) (CWE-732).

source: Temporary file race condition in certain cases (e.g., if run as SYSTEM in many versions of Windows) (CWE-377)
ru_ru: В некоторых случаях использования временных файлов возможно возникновение гонки условий (например, при запуске от имени учетной записи SYSTEM во многих версиях Windows) (CWE-377).

source: This causes a new program to execute and is difficult to use safely (CWE-78)
ru_ru: Вызывает новую программу на исполнение. Затруднено безопасное использование (CWE-78).

source: This causes a new process to execute and is difficult to use safely (CWE-78)
ru_ru: Вызывает на исполнение новый процесс. Трудно реализовать безопасный вариант использования (CWE-78).

source: Unless checked, the resulting number can exceed the expected range (CWE-190)
ru_ru: Целочисленное переполнение или зацикливание диапазона. Если не произведена проверка, результирующее значение может превышать ожидаемый диапазон (CWE-190).

source: This function is not sufficiently random for security-related functions such as key and nonce creation (CWE-327)
ru_ru: Степень случайности генерируемых функцией значений недостаточна для выполнения функций, связанных с безопасностью (например, создание ключей и кодов nonce) (CWE-327).

source: Function crypt is a poor one-way hashing algorithm; since it only accepts passwords of 8 characters or less, and only a two-byte salt, it is excessively vulnerable to dictionary attacks given today's faster computing equipment (CWE-327)
ru_ru: Функция crypt() - слабый односторонний алгоритм хеширования, так как он принимает пароли длиной только 8 символов или менее, и только два байта соли, что делает его слишком уязвимым для атак по словарю с использованием современной быстродействующей вычислительной техники (CWE-327).

source: DES only supports a 56-bit keysize, which is too small given today's computers (CWE-327)
ru_ru: DES поддерживает только 56-битные ключи, что слишком мало для действенной защиты, учитывая вычислительные мощности современных компьютеров (CWE-327)

source: These keysizes are too small given today's computers (CWE-327)
ru_ru: Размер используемых ключей слишком мал для действенной защиты, учитывая вычислительные мощности современных компьютеров (CWE-327)

source: chroot can be very helpful, but is hard to use correctly (CWE-250, CWE-22)
ru_ru: Использование функции chroot() может быть полезным, однако её трудно использовать корректно (CWE-250, CWE-22).

source: Environment variables are untrustable input if they can be set by an attacker. They can have any content and length, and the same variable can be set more than once (CWE-807, CWE-20)
ru_ru: Переменные окружения являются недоверенным источником данных, если они могут быть установлены атакующим. Они могут иметь любое содержимое и длину, одна и та же переменная может быть установлена более чем один раз (CWE-807, CWE-20).

source: This function is synonymous with 'getenv("HOME")'; it returns untrustable input if the environment can be set by an attacker. It can have any content and length, and the same variable can be set more than once (CWE-807, CWE-20)
ru_ru: Эта функция является синонимом 'getenv('HOME')', возвращает недоверенный ввод, если окружение программы может контролироваться злоумышленником. Может иметь любую длину и содержание, одна и та же переменная может быть установлена более чем один раз (CWE-807, CWE-20).

source: This function is synonymous with 'getenv("TMP")'; it returns untrustable input if the environment can be set by an attacker. It can have any content and length, and the same variable can be set more than once (CWE-807, CWE-20)
ru_ru: Эта функция является синонимом 'getenv('TMP')', возвращает недоверенный ввод, если окружение программы может контролироваться злоумышленником. Может иметь любую длину и содержание, одна и та же переменная может быть установлена более чем один раз (CWE-807, CWE-20).

source: If this call fails, the program could fail to drop heightened privileges (CWE-250)
ru_ru: Если вызов закончится неудачей, программа может не отклонить повышенние привелегий (CWE-250)

source: Ensure that the full path to the library is specified, or current directory may be used (CWE-829, CWE-20)
ru_ru: Убедитесь, что указан полный путь к библиотеке, иначе будет использован текущий каталог (CWE-829, CWE-20).

source: Never create NULL ACLs; an attacker can set it to Everyone (Deny All Access), which would even forbid administrator access (CWE-732)
ru_ru: Никогда не создаёт NULL ACL, атакующий может установить его в значение Все(Запретить все виды доступа), которое запретит доступ даже администратору (CWE-732).

source: This doesn't set the inheritance bits in the access control entry (ACE) header (CWE-732)
ru_ru: Функция не устанавливает биты наследования в заголовке записей контроля доступа (ACE) (CWE-732).

source: It's often easy to fool getlogin. Sometimes it does not work at all, because some program messed up the utmp file. Often, it gives only the first 8 characters of the login name. The user currently logged in on the controlling tty of our program need not be the user who started it. Avoid getlogin() for security-related purposes (CWE-807)
ru_ru: Часто встречаются случаи легко реализуемого обхода функции getlogin(). Иногда она не работает вообще, потому что какая-то программа испортил файл utmp. Часто, эта функция выдает только первые 8 символов имени логина. Пользователь, вошедший в систему в настоящее время с управляющего терминала программы не обязательно может быть пользователем, запустившим его. Следует избегать использования функции getlogin() для целей, связанных с безопасностью (CWE-807).
