Repository: Noospheratu/FlawFinder.new
Catalog: i18n/*/LC_MESSAGES/flawfinder.po
Languages: ru_ru

source: Exactly what cuserid() does is poorly defined (e.g., some systems use the effective uid, like Linux, while others like System V use the real uid). Thus, you can't trust what it does. It's certainly not portable (The cuserid function was included in the 1988 version of POSIX, but removed from the 1990 version). Also, if passed a non-null parameter, there's a risk of a buffer overflow if the passed-in buffer is not at least L_cuserid characters long (CWE-120)
ru_ru: Важно то, что функция cuserid() плохо определена (например, некоторые системы используется эффективный идентификатор, как в Linux, в то время как в других, как System V, используется реальный UID). Таким образом, нет возможности доверять тому, что данная функция делает. Эта функция не переносима (функция cuserid была включена в версию POSIX 1988 г., но удалена из версии 1990г.). Кроме того, в случае принятия ненулевого параметра, есть риск переполнения буфера, если приемный буфер не имеет длину по крайней мере L_cuserid символов (CWE-120).

source: This function is obsolete and not portable. It was in SUSv2 but removed by POSIX.2. What it does exactly varies considerably between systems, particularly in where its prompt is displayed and where it gets its data (e.g., /dev/tty, stdin, stderr, etc.) (CWE-676)
ru_ru: Данная функция устарела и не является переносимой. Она присутствовалав SUSv2, но была удалена в POSIX.2. Точное определение того, что делает данная функция, значительно варьируется между системами, в частности, то, где отображается приглашение ко вводу и откуда функция получает свои данные (например, /dev/tty, stdin, stderr, и т.д.) (CWE-676).

source: These functions are considered obsolete on most systems, and very non-poertable (Linux-based systems handle them radically different, basically if gsignal/ssignal were the same as raise/signal respectively, while System V considers them a separate set and obsolete) (CWE-676)
ru_ru: Эта функция считается устаревшей в большинстве ОС и крайне непереносима (системы на основе Linux обрабатывают их крайне различными способами, в основном если в Linux функции gsignal\ssignal аналогичны функциям raise/signal соответственно, то System V считает их отдельным множеством и устаревшими функциями) (CWE-676).

source: On some systems (though not Linux-based systems) an attempt to free() results from memalign() may fail. This may, on a few systems, be exploitable. Also note that memalign() may not check that the boundary parameter is correct (CWE-676)
ru_ru: В некоторых системах (не в системах на основе Linux) попытка вызвать функцию free() из функции mamalign() может привести к сбою. На некоторых системах это может привести к эксплуатации уязвимости. Также необходимо учитывать, что функция memalign() может не проверять, что границы параметров корректны (CWE-676).

source: This C routine is considered obsolete (as opposed to the shell command by the same name, which is NOT obsolete) (CWE-676)
ru_ru: Данная функция считается устаревшей (в отличие от одноимённой команды shell, которая не устарела) (CWE-676).

source: This C routine is considered obsolete (as opposed to the shell command by the same name). The interaction of this function with SIGALRM and other timer functions such as sleep(), alarm(), setitimer(), and nanosleep() is unspecified (CWE-676)
ru_ru: Данная функция считается устаревшей (в отличие от одноимённой команды shell, которая не устарела). Взаимодействие данной функции с SIGALRM и другими функциями таймеров, такими как sleep(), alarm(), setitimer() и nanosleep(), не определено (CWE-676).

source: Function accepts input from outside program (CWE-20)
ru_ru: Функция принимает ввод из внешних программ (CWE-20).

source: Skipping unpatched file
ru_ru: Пропуск неисправленого файла

source: Skipping unpatched file
ru_ru: Пропуск неисправленого файла

source: BUG! Somehow got a symlink in process_c_file!
ru_ru: ﻿BUG! Каким-то образом получил символическую в process_c_file!

source: Examining
ru_ru: Исследование

source: File ended while in comment.
ru_ru: Файл закончился в комментарии.

source: File ended while in string.
ru_ru: Файл закончился в строке.

source: Error: Rule {rule}, when expanded, overlaps {newrule}
ru_ru: Ошибка: Правило {rule}, при расширении перекрывает {newrule}

source: Number of rules (primarily dangerous function names) in C/C++ ruleset:
ru_ru: Количество правил (в первую очередь опасные названия функций) в наборе правил C/C++:

source: <title>Flawfinder Results</title>
ru_ru: ﻿<title>Результаты Flawfinder</title>

source: <h1>Flawfinder Results</h1>
ru_ru: <h1>Результаты Flawfinder</h1>

source: Here are the security scan results from
ru_ru: Результаты сканирования безопасности с помощью

source: <a href="http://www.dwheeler.com/flawfinder">Flawfinder version {version}</a>,
ru_ru: <a href="http://www.dwheeler.com/flawfinder">Flawfinder версия {version}</a>,

source: Flawfinder version {version}, (C) 2001-2014 David A. Wheeler.
ru_ru: Flawfinder версия {version}, (C) 2001-2014 David A. Wheeler.

source: Skipping symbolic link directory
ru_ru: Пропуск символьной ссылки на папку

source: Skipping directory with initial dot
ru_ru: Пропуск папки с начальной точкой

source: Skipping symbolic link file
ru_ru: Пропуск символьной ссылки на файл

source: Skipping non-regular file
ru_ru: Пропуск необычного файла

source: Skipping symbolic link
ru_ru: Пропуск символьной ссылки

source: Skipping non-existent filename starting with UTF-8 long dash
ru_ru: Пропуск не существующего файла, начинающегося с длинного тире в UTF-8

source: Skipping non-existent file
ru_ru: Пропуск несуществующего файла

source: *** No input files
ru_ru: *** Не указаны исходные файлы

source: <h2>Final Results</h2>
ru_ru: <h2>Конечные результаты</h2>

source: FINAL RESULTS:
ru_ru: КОНЕЧНЫЕ РЕЗУЛЬТАТЫ:

source: <h2>Analysis Summary</h2>
ru_ru: <h2>Итоги анализа</h2>

source: ANALYSIS SUMMARY:
ru_ru: ИТОГИ АНАЛИЗА:

source: Hits =
ru_ru: Срабатываний =

source: No hits found.
ru_ru: Не найдено срабатываний.

source: Hits limited to regular expression
ru_ru: Срабатывания ограничены регулярным выражением

source: Lines analyzed = {sumlines}
ru_ru: Строк проанализировано = {sumlines}

source: in approximately {time_analyzing:.2f} seconds ({lines_second:.0f} lines/second)
ru_ru: примерно {time_analyzing:.2f} секунд ({lines_second:.0f} строк в секунду)

source: Physical Source Lines of Code (SLOC) = {sloc}
ru_ru: Физическое количество строк кода (SLOC) = {sloc}

source: Minimum risk level = {minimum_level}
ru_ru: ﻿Минимальный уровень риска = {minimum_level}

source: Not every hit is necessarily a security vulnerability.
ru_ru: ﻿Не каждый хит это обязательно уязвимость.

source: There may be other security vulnerabilities; review your code!
ru_ru: ﻿Там могут быть и другие уязвимости; проверьте код!

source: See '<a href="http://www.dwheeler.com/secure-programs">Secure Programming for Linux and Unix HOWTO</a>'
ru_ru: Смотрите '<a href="http://www.dwheeler.com/secure-programs">Secure Programming for Linux and Unix HOWTO</a>'

source: (<a href="http://www.dwheeler.com/secure-programs">http://www.dwheeler.com/secure-programs</a>) for more information.
ru_ru: (<a href="http://www.dwheeler.com/secure-programs">http://www.dwheeler.com/secure-programs</a>) для получения дополнительной информации.

source: See 'Secure Programming for Linux and Unix HOWTO'
ru_ru: Смотрите 'Secure Programming for Linux and Unix HOWTO'

source: (http://www.dwheeler.com/secure-programs) for more information.
ru_ru: (http://www.dwheeler.com/secure-programs) для получения дополнительной информации.

source: *** Flawfinder interrupted
ru_ru: *** Flawfinder анализ прерван
